---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarElemEndtreatmentStart
source: html/a2026990-0618-53fc-4b5b-ec7bcbee2d75.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarElemEndtreatmentStart Property

"End Treatment At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarElemEndtreatmentStart { get; }
```